# General tools
brew "tmux"
brew "bash"
brew "zsh"
brew "wget"
brew "curl"
brew "figlet"
brew "fpp"
brew "fdupes"
brew "ncdu"
brew "gdu"
brew "clipper"
brew "reattach-to-user-namespace"
brew "socat"
brew "weechat"
brew "aria2"
brew "pandoc"
brew "poppler"
brew "fd"
brew "p7zip"
brew "unar"
brew "ifstat"
brew "cheat"
brew "rsync"
brew "htop"
brew "hyperfine"
brew "imagemagick"
brew "mas"
brew "fzf"
brew "pam-reattach"

# Dev tools
brew "gcc"
brew "git"
brew "git-lfs"
brew "gh"
brew "vim"
brew "neovim"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "node"
brew "fnm"
brew "deno"
brew "ruby"
brew "python"
brew "pipenv"
brew "bat"
brew "glow"
brew "diff-so-fancy"
brew "difftastic"
brew "git-delta"
brew "ack"
brew "ripgrep"
brew "ripgrep-all"
brew "jq"
brew "watchman"
brew "cmake"

# Dependencies
brew "tesseract"
brew "tesseract-lang"
brew "ghostscript"
brew "ffmpeg"
brew "gifsicle"
brew "lame"
brew "atomicparsley"
brew "coreutils"
brew "moreutils"
brew "parallel", conflicts_with: ["moreutils"]
brew "libdvdcss"
brew "openssh"
brew "gnutls"
brew "libssh2"
brew "glib"
brew "qt"
brew "sdl2"
brew "srt"

# Casks
cask "xquartz"
cask "rectangle"
cask "imageoptim"
cask "ghostty"
cask "iterm2"
cask "keka"
cask "xbar"
cask "oracle-jdk"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "stats"
cask "iina"
cask "vlc"
cask "docker-desktop"
cask "firefox"
cask "gimp"
cask "notunes"
cask "quicklook-video"
cask "qlmarkdown"
cask "sublime-text"
cask "mediainfo"
cask "shottr"
cask "obsidian"
cask "hmarr/tap/vitals"
cask "raycast"
cask "rocket"
cask "latest"
cask "ImHex"
cask "coconutbattery"
cask "beeper"
cask "deepl"
cask "deskflow/homebrew-tap/deskflow"
cask "clop"
cask "virtualbox"

# AppStore
mas "Velja", id: 1607635845
mas "Pandan", id: 1569600264
mas "MusicBox", id: 1614730313
mas "Reeder", id: 1529448980
mas "ToyViewer", id: 414298354
mas "PDFgear", id: 6469021132
mas "PDFOptim", id: 621276561

# Safari Extensions
mas "1Blocker", id: 1365531024
mas "1Password for Safari", id: 1569813296
mas "Consent-O-Matic", id: 1606897889
mas "SponsorBlock", id: 1573461917
mas "Vinegar", id: 1591303229
