tap "uptech/oss"

# General tools
brew "tmux"
brew "bash"
brew "zsh"
brew "wget"
brew "curl"
brew "figlet"
brew "fpp"
brew "fdupes"
brew "ncdu"
brew "clipper"
brew "reattach-to-user-namespace"
brew "socat"
brew "weechat"
brew "aria2"
brew "pandoc"
brew "poppler"
brew "ranger"
brew "fd"
brew "p7zip"
brew "unar"
brew "ifstat"
brew "osx-cpu-temp"
brew "cheat"
brew "rsync"
brew "htop"
brew "hyperfine"
brew "imagemagick"
brew "mas"
# brew "spek"

# Dev tools
brew "gcc"
brew "git"
brew "vim"
brew "neovim"
brew "nginx"
brew "node"
brew "deno"
brew "ruby"
brew "python"
brew "pipenv"
brew "bat"
brew "diff-so-fancy"
brew "git-delta"
brew "ack"
brew "ripgrep"
brew "ripgrep-all"
brew "jq"
brew "uptech/oss/alt"
brew "watchman"
brew "cmake"

# Dependencies
# brew "graphicsmagick"
brew "tesseract"
brew "tesseract-lang"
brew "ghostscript"
brew "ffmpeg"
brew "lame"
brew "atomicparsley"
brew "moreutils"
brew "libdvdcss"
brew "openssh"
brew "gnutls"
brew "libssh2"
brew "glib"
brew "qt"
brew "sdl2"
brew "srt"

# Casks
cask "xquartz"
cask "rectangle"
cask "imageoptim"
cask "iterm2"
cask "keka"
cask "typora"
cask "xbar"
cask "oracle-jdk"
cask "balance-lock"
cask "dozer"
cask "karabiner-elements"
cask "stats"
cask "iina"
cask "vlc"
cask "docker"
cask "firefox"
cask "gimp"
cask "notunes"
cask "qlvideo"
cask "qlmarkdown"
cask "skype"
cask "spotify"
cask "sublime-text"
cask "mediainfo"
cask "shottr"
cask "obsidian"
# cask "oversight"
